kirtikaran3/TM4C/UART PutChar/main.c
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"

int main(void) {

	SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

		GPIOPinConfigure(GPIO_PA0_U0RX);
		GPIOPinConfigure(GPIO_PA1_U0TX);
		GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

		UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200,(UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));

			UARTCharPut(UART0_BASE, 'K');
			UARTCharPut(UART0_BASE, 'I');
			UARTCharPut(UART0_BASE, 'R');
			UARTCharPut(UART0_BASE, 'T');
			UARTCharPut(UART0_BASE, 'I');

			UARTCharPut(UART0_BASE, ' ');
			UARTCharPut(UART0_BASE, 'D');
			UARTCharPut(UART0_BASE, 'E');
			UARTCharPut(UART0_BASE, 'M');
			UARTCharPut(UART0_BASE, 'O');
			UARTCharPut(UART0_BASE, ':');
			UARTCharPut(UART0_BASE, ' ');

					while (1){

							if (UARTCharsAvail(UART0_BASE)) UARTCharPut(UART0_BASE, UARTCharGet(UART0_BASE));
					}
	}
